def one():
    tcp / ip 구성요소 ip, 서브넷, 게이트웨이 , dns

    alt:
        Esc : 창전환 키
        enter 속성창
        space(폴더창) 바로가기
        tab 모든 창 미리보기 /// 조심 윈도우 탭 : 3차원 형태
    ctrl:
        esc 시작메뉴
        shift 바로가기 아이콘 만들어짐
    shift:
        f10: 바로가기
        delete : 영구삭제
    바이트 : 8비트, 영숫자1,한글한자2, 256가지 정보표현
    멀티미디어 :
        디지털로 통합 처리
        상호작용 데이터 전달
        여러 미디어 통합처리
        랜더링 : 3차원 질감 사실감 더함
        디더링 : 제한된 색 조합 > 여러컬러
        앨리어싱 : 계단형태
        모핑 : 이미지 변화가는 과정
        안티앨리어싱 : 2차원 에서 경계면 픽셀 부드럽게
    컴파일러: 전체,실행빠름,번역느림,프로그램생성o
    인터프리터: 한줄,실행느림,번역빠름,프로그램생성x

    소프트웨어 분류 유형
        업데이트 :
            if 트라이얼 :체험판 , elif 알파:베타꺼 테스트, elif 프리: 무려

    네트워크 구성:
        망 : 응답 빠르고, 연결성 우수
        버스 : 여러장치 연결, 신뢰성 올라감, 기밀보잠 어려움, 제한있음
    운영체제:
        시스템 소프트웨어: 중계자역할, 효율적운영, 제어와 처리로 나뉨
        임베디드 :
            두뇌역할, 가전제품, 컴퓨터기능탑재
            하드웨어, 소프트웨어 하나로 결합

    운영방식:
        네트워크 운영: 클/서버, 동배간
        데이터전송 : 직렬,병렬
    코드:
        에러컴출코드 :패리티체크비트(parity bit)
        문자표현:
            유니코드 : 63자, 줌비트와 디지털 비트로 구성
            ascll코드 : 7비트 128가지 문자, 데이터 통신용
            ebcdic코드 : 8비트, 256가지
            bcd 코드 : 6비트 64가지 ,영문소문자 불가능

    벡터방식: 직선곡선 > 이미지
    비트맵방식: bmp,gif,jpeg,png, 사실적이미지, 화면표시속도 빠름, 다양한색상

    웹 브라우저 기능
        인터넷 옵션: 보안설정 시작페이지,비밀번호 저장,
        ftp접속, 저장인쇄
        ftp: 네트워크 연결된 컴퓨터끼리 데이터 교환 / id 필요 / 다운,삭제,변경 가능/ 다운받아야 실행가능
    url:프로//호스트/포트/파일
    osl7 계층 네트워크이루는 구성요소들 계층적으로나누고 표준정함
    iso7 계층
    정보보안
        가로막기 > 전달방해 ,가용성저해
        가로채기 > 도청,몰래봄, 기밀성 저해
        변조/수정 > 내용 수정, 무결성 저해
        위조 > 송신된것처럼 꾸밈, 무결성 저해

    음향, 영상
        dvi : 동영상압축기술
        ieee-1394: 매킨토시요 직렬 인터페이스,최대 63개, 빠른속도
        hdmi :영상 음성 한번에
        usb : 주변장치연결
        mpeg : 돋영상전문가그룹>압축표준

    컴퓨터
        키보드속성:
            재입력시간, 커서깜박임속도, 반복속도
        인터넷:
            iptv : 초고속 인터넷망 양방향
            Voip : ip 사용한 음성전화, 저렴, 품질 안 좋아짐, 음성을패킷형태
            tcp/ip : 컴퓨터간 데이터 전송 가능 / tcp: 단위로 나눠 포장하고, ip:주고받음
            ipv6 : 16비트씩8부분 / 호환,융통,연동 굿,
        방화벽:
            통신 허용/기능설정
            문제 해결방법 제공
            바이러스 x ,백신이 하는겨
            오부 연결 차단여부 설정
        제어판
            프로그램 및 기능:
                업데이트 확인, 제거, 변경 / 자동수행불가능
            접근성센터:
                돋보기, 내래이터,화상키보드
            디스플레이:
                모니터
            시스템:
                운영체제, cpu, 메모리크기, 정품인증가능, 컴퓨터이름, 설명
            네트워크및공유센터:
                네트워크 검색, 파일 및 프린터 공유, 공용폴더 공유, 미디어 스트리밍
        메모리:
            ram 휘발 rom 비휘발
            가상 > 보조를 주처러 사용
            캐시 > 중간위치 속도 업
            플래시 > 비휘발성, 블록단위, 입출력자유 ,전송빠름, 전력소모작음
            연관 > 일부 이용해서 접근
            디스크 캐시: 파일을 미리 읽어 속도높임
        중앙처리장치:
            ALU(다양한 실제 연산), CU(시스템 작동 통제 및 지시), Register(임시기억장치)
        하드디스크:
            ssd :소형,경향, 발열소음 작음,비쌈 (보조기억장치), 충격강함
        운영체제:
            스케쥴링제공/ 인터페이스제공/ 자원공유기능
        프린터:충격식, 비충격식 나눔 False
            충격식 > 체인식 밴드식
            비충격식 > 레이저
            네트워크:포트지정x, 로컬:포트지정o
            레이저 > 토너, 비충격 속도 빠름, 해상도높음
        usb:
            직렬보다 빠름, 127개,핫플러그인 플러그앤플레이 지원
            3.1 빨,하 / 3.0 파랑 / 2,0 흰,검
        인터넷:
            사물인터넷,lot:
                빅테이터 저장,분석, 저렴
                전부 연결, 분석, 지능화, 복합기술
                현재 의사결정내리는 단계 발전, 비쌈, 보안문제

    유틸리티 프로그램:
        다수작업,편리,도움주는프로그램, ex)메모장,그림판
    디스크:
        정리 : 임시파일, 휴지통, 다운로드, 쿠키, 오프라인웹
        디스크최적화(조각모음): 디스크 단편화, 접근속도를향상
        포맷 :  초기화 트랙과 섹터로 구성
    자료: 숫자,그림
    정보: 이용가능한 형태
    정보화: 정보 확산

def two():
    피벗 테이블:
        더블클릭 > 세부적인 데이터가 새로운 시트에 표시
        요약정보만 표시 가능, 다양한 방식으로 요약표시 가능,
        피벗 테이블과 피벗 차트를 만든 후 피벗 테이블 삭제하면 피벗차트 > 일반차트로 변경
    데이터
        통합 :
            위치기준, 영역기준 ,
            통합결과가 작성될 워크시트가 같은 통합문서는 x
            일치하지 않으면 별도 만들어줌
            다른문서 입력 데이터 통합 o
    부분합 :
        정렬 필수, 인쇄시 다른페이지에 인쇄, 이미된거에 + 새로운값으로 대치 해제
    매크로:
        alt+f11 > visula Basic Editor 실행된다.로
        alt+f8 : 매크로 목록 띄움
        대문자 입력시 > ctrl +shift 가 조합키
        특수문자 x, 대소문자 구별 x, 공백x, 중복시 물어봄, 동일이름 x, xlsb로 저장
    차트:
        셀 맞춤키 alt
        정렬: 24줄, 색,값 기준가능, 숨겨진거x, 병합 x, 기준64개
        ctrl d : 위쪽, r은 오른쪽
        Home키 선택한 셀의 가장 왼쪽
        날짜 및 시간 오른쪽 맞춤
        범례:
            Delete 제거, 겹치치않음, 크기변경>>자동조정x, 위치이동 >> 자동조정o
        셀:
            255자, 대소문자x, 첫글자 문자,밑줄,역슬래시, 공백x
    워크시트:
        ctrl + enter 선택한범위 같은값
        ctrl + 마우스 동일내용복사
        alt + enter : 아래
        shift + enter : 위
        ctrl + shift + l :현재시간
        pageup, pagedn = 위,아래
        alt + pageup, pagedn = 좌, 우
        ctrl + pageup, pagedn = 시트 앞,뒤
    정렬:
        기본 오름차순, false먼저, 숫자 음수에서양수, 빈 셀은 항상 마지막
    서식:
        임의날짜기준없음
        셀 값 기준 모든 셀 서식 지정
        다음 포함하는 셀만 서식 지정
        고유 또는 중복 값만 서식지정
    페이지:
        나누기:
            페이지 단위 구분선
            마우스로 조절, 행열 변경시 구분선변경됨
            @ 미리보기> 파선: 자동, 실선: 사용자지정
    인쇄 미리보기(ctrl+F12) 및 인쇄:
        눈금선, 행/열 머리글 설정, 10 ~ 400
    와일드카드인 ? * 찾는 방법 : ~ 기호 입력

    시나리오(데이터도구-가상분석):
        32개 변경셀, 시나리오써서 값 변경하면 원래의 값 못 돌림, 병합해서 가져오기o

    LARGE,SWALL : 큰값, 작은값
    COUNT: 문자가 아닌 숫자만 계산
    COUNTIF(조건범위, 조건) 문자 가능
    COUNTA : 비어있지 않은 셀의 개수
    MID(텍스트, 시작위치, 추출할 글자수
    LEFT(텍스트, 추출할 글자수) 공백 포함
    VLOOKUP( 찾을값, 참조범위, '열'번호, 옵션) 옵션 자리에 True > 근사값 False 정확한 값 !가로
    HLOOKUP( 찾을값, 참조범위, '행'번호, 옵션) !세로 False 일때 오름차순 x True 일때는 오름차순이어야함/ 숫자일때 근사값구해야해서 True 씀
    INDEX(범위, 행 번호, 열 번호, 참조 영역 번호): 표나 범위의 값이나 값에 대한 참조 영역을 구함
    AVERAGEA : 수치가 아닌 셀을 포함하는 인수의 평균값
    AVERAGEA : 인수 중 평균값
    AVERAGEIFS : 여러 조건에 맞는 셀들의 평균값
    DAVERAGE : 범위에서 조건에 맞는 평균
    Mod : 나머지값
    POWER(인수, 제곲갓) : 인수의 거듭 제곱갓
    TRUNC(인수,자릿수) : 지정한 자릿수로 내림
    SQRT(인수) : 인수의 양의 제곱근, 인수가 음수이면 에러

    PROPER(텍스트 첫 글자 대문자)
    TRAM(양쪽 공백 제거)


#  ---- 실기 ----


=rank.eq(기준셀,범위,(0,1))) 0 은 내림차순 1은 오름차순
=count(범위) # 숫자, 날짜, 시간만 가능
=counta(범위) # 비어있지 않은 셀의 개수
=if(조건,참,거짓)
=countif(범위,조건)
=countifs(범위1,조건1,범위2,조건2)
=sumifs(합계범위,범위1,조건1,범위2,조건2) # 동시에 만족 # 총점 합계
=sumif(범위1,조건1,합계범위)
=averageifs(평균범위,범위1,조건1,범위2,조건2)
=and(조건1,조건2,...) # 둘 다 참 이어야 함
=or(조건1,조건2,...) 아무거나 참
=vlookup(기준셀,참조범위,열번호,(0,1)) 0 은 정확한값(false)인가, 1 은 근사치(true)인가 데이터가 아래로
=hlookup(기준셀,참조범위,행번호,(0,1)) 0 은 정확한값(false)인가, 1 은 근사치(true)인가 데이터가 옆으로
=large(범위,k) k 번째로 큰 수 찾
=mode(범위) 빈도수
=choose(k,'문자1','문자2') k의 값의 의해서 선택을 받음
=days360(시작일,종료일)



























